text_help = """ساخت رمز های قدرتمند و خوانا

ایده زمانی به ذهنم آمد که داشتم با خودم میگفتم، چرا یه ربات ندارم که بصورت اینلاین رمز تولید کنه؛ پس ساختمش!
با کمک این ربات رمز های قدرتمند و خوانا برای برنامه ها یا وبسایت ها ایجاد کنید.

کلمه های دلخواه خود را با دستور /settings وارد کنید و رمز های خودتون رو با دستور /generate ایجاد کنید.

<b>موارد دردسترس</b>:

/generate_weak (رمز ضعیف)
۲ کلمه، بدون جداسازی کلمات

/generate_normal (رمز معمولی)
۳ کلمه، بدون جداسازی کلمات، کلمه میانی با حروف بزرگ

/generate_strong (رمز قوی)
۳ کلمه، جداسازی با اعداد تصادفی، حروف بزرگ تصادفی

/generate_stronger (رمز بسیار قوی)
۴ کلمه، جداسازی با اعداد تصادفی، حروف بزرگ تصادفی

/generate_insane (رمز دیوانه - خیلی قدرتمند)
۴ کلمه، جداسازی با حروف تصادفی، پیشوند تصادفی، پسوند تصادفی، کلمه دوم با حروف بزرگ

دنبال کننده جامعه نرم افزار آزاد(FSF) هستیم و سورس کد ربات درون <a href="https://github.com/MSXtm/PassGenRobot">گیت هاب</a> قابل دریافت است."""

text_start = """
با کمک این ربات رمز های خوانا درست کنید.
روی "[ / ]" کلیک کنید و از موارد داده شده با سختیِ دلخواه رمز تولید کنید یا از دستور /generate برای ساخت رمز دلخواه استفاده کنید.

تنظیمات رمز دلخواه درون /settings هست.

برای دریافت سورس کد یا راهنما فقط کافی است دستور /help را بفرستید.

⚡️ @MSXtm"""

text_settings_choose = """تنظیمات فعلی شما:
<b>تعداد کلمات</b>: {num_of_words!s}
<b>پسوند و پیشوند</b>: {prefixes}
<b>جداکننده بین کلمات</b>: {separators}
    
تنظیمات از طریق دکمه های زیر قابل ویرایش هست.
بعد از اینکه رضایت از نتیجه دارید؛ دستور /generate را بفرستید."""

strings = {
    "fa": {
        "start": text_start,
        "help": text_help,
        "settings": text_settings_choose,
        "plusword": "+ کلمه",
        "minusword": "- کلمه",
        "pluspref": "نصب پسوند و پیشوند ⚙️",
        "minuspref": "حذف پسوند و پیشوند ❌",
        "plussep": "نصب جداکننده ها ⚙️",
        "minussep": "حذف جداکننده ها ❌",
        "regenerate": "🔄 تولید مجدد",
        "no": "خیر",
        "yes": "بله"
    },
}
